# Rebar Rebar Shape Matches Curves Hooks And End Treatment Method

Source: https://www.revitapidocs.com/2026/8fd9c444-b123-7f85-479b-aa55ce74ade6.htm

---

| Rebar Rebar Shape Matches Curves Hooks And End Treatment Method |
| --- |

**Note: This API is now obsolete.**

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.RebarShapeMatchesCurvesAndTerminationsData(RebarShape rebarShape, RebarBarType barType, XYZ norm, IList<Curve> curves, BarTerminationsData barTerminationsData) instead.")]
public static bool RebarShapeMatchesCurvesHooksAndEndTreatment(
	RebarShape rebarShape,
	RebarBarType barType,
	XYZ norm,
	IList<Curve> curves,
	RebarHookType startHook,
	RebarHookType endHook,
	RebarHookOrientation startHookOrient,
	RebarHookOrientation endHookOrient,
	double terminationRotationAngleAtStart,
	double terminationRotationAngleAtEnd,
	ElementId endTreatmentTypeIdAtStart,
	ElementId endTreatmentTypeIdAtEnd
)
```

```
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.RebarShapeMatchesCurvesAndTerminationsData(RebarShape rebarShape, RebarBarType barType, XYZ norm, IList<Curve> curves, BarTerminationsData barTerminationsData) instead.")>
Public Shared Function RebarShapeMatchesCurvesHooksAndEndTreatment (
	rebarShape As RebarShape,
	barType As RebarBarType,
	norm As XYZ,
	curves As IList(Of Curve),
	startHook As RebarHookType,
	endHook As RebarHookType,
	startHookOrient As RebarHookOrientation,
	endHookOrient As RebarHookOrientation,
	terminationRotationAngleAtStart As Double,
	terminationRotationAngleAtEnd As Double,
	endTreatmentTypeIdAtStart As ElementId,
	endTreatmentTypeIdAtEnd As ElementId
) As Boolean
```

```
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.RebarShapeMatchesCurvesAndTerminationsData(RebarShape rebarShape, RebarBarType barType, XYZ norm, IList<Curve> curves, BarTerminationsData barTerminationsData) instead.")]
static bool RebarShapeMatchesCurvesHooksAndEndTreatment(
	RebarShape^ rebarShape,
	RebarBarType^ barType,
	XYZ^ norm,
	IList<Curve^>^ curves,
	RebarHookType^ startHook,
	RebarHookType^ endHook,
	RebarHookOrientation startHookOrient,
	RebarHookOrientation endHookOrient,
	double terminationRotationAngleAtStart,
	double terminationRotationAngleAtEnd,
	ElementId^ endTreatmentTypeIdAtStart,
	ElementId^ endTreatmentTypeIdAtEnd
)
```

```
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.RebarShapeMatchesCurvesAndTerminationsData(RebarShape rebarShape, RebarBarType barType, XYZ norm, IList<Curve> curves, BarTerminationsData barTerminationsData) instead.")>]
static member RebarShapeMatchesCurvesHooksAndEndTreatment :
        rebarShape : RebarShape *
        barType : RebarBarType *
        norm : XYZ *
        curves : IList<Curve> *
        startHook : RebarHookType *
        endHook : RebarHookType *
        startHookOrient : RebarHookOrientation *
        endHookOrient : RebarHookOrientation *
        terminationRotationAngleAtStart : float *
        terminationRotationAngleAtEnd : float *
        endTreatmentTypeIdAtStart : ElementId *
        endTreatmentTypeIdAtEnd : ElementId -> bool
```

#### Parameters

rebarShape RebarShape
barType RebarBarType
norm XYZ
curves IList Curve
startHook RebarHookType
endHook RebarHookType
startHookOrient RebarHookOrientation
endHookOrient RebarHookOrientation
terminationRotationAngleAtStart Double
terminationRotationAngleAtEnd Double
endTreatmentTypeIdAtStart ElementId
endTreatmentTypeIdAtEnd ElementId

#### Return Value

Boolean See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace